# -*- coding: utf-8 -*-
#####################################################################################################################
#                                                                                                                   #
# Парсер среднего количества просмотров за месяц у официальных СМИ                                                  #
#                                                                                                                   #
# MIT License                                                                                                       #
# Copyright (c) 2020 Michael Nikitenko                                                                              #
#                                                                                                                   #
#####################################################################################################################


def parse_mm():
    return [{'comments': 2.86, 'likes': 36.43, 'link': 'https://vk.com/club9792', 'location': 'Новый Уренгой', 'name': 'ГОРОРО | Новый Уренгой', 'sn': 'ВКонтакте', 'subs': 71376, 'views': 5686.94},]


if __name__ == '__main__':
    print('mm_parser')

