# -*- coding: utf-8 -*-
#####################################################################################################################
#                                                                                                                   #
# Парсер среднего количества просмотров за месяц у официальных СМИ                                                  #
#                                                                                                                   #
# MIT License                                                                                                       #
# Copyright (c) 2020 Michael Nikitenko                                                                              #
#                                                                                                                   #
#####################################################################################################################


def parse_mm():
    return [{'name': 'ololol', 'sn': 'Интернет', 'link': 'https://yamal.com', 'location': 'Салехард', 'subs': 1488, 'views': 420},]


if __name__ == '__main__':
    print('mm_parser')

