# -*- coding: utf-8 -*-
#####################################################################################################################
#                                                                                                                   #
# Парсер количества подписчиков и среднего количества просмотров за месяц для социальной сети Одноклассники         #
#                                                                                                                   #
# MIT License                                                                                                       #
# Copyright (c) 2020 Michael Nikitenko                                                                              #
#                                                                                                                   #
#####################################################################################################################


def parse_ok():
    return [{'name': 'ololol', 'sn': 'ОК', 'link': 'https://ok.ru', 'location': 'Салехард', 'subs': 1488, 'views': 420},]


if __name__ == '__main__':
    print('ok_parser')
