# -*- coding: utf-8 -*-
#####################################################################################################################
#                                                                                                                   #
# Парсер количества подписчиков и среднего количества просмотров за месяц для мессенджера Телеграм                  #
#                                                                                                                   #
# MIT License                                                                                                       #
# Copyright (c) 2020 Michael Nikitenko                                                                              #
#                                                                                                                   #
#####################################################################################################################


def parse_tg():
    return [{'name': 'ololol', 'sn': 'Телеграм', 'link': 'https://telegram.org', 'location': 'Салехард', 'subs': 1488, 'views': 420},]


if __name__ == '__main__':
    print('tg_parser')
