# -*- coding: utf-8 -*-
#####################################################################################################################
#                                                                                                                   #
# Парсер количества подписчиков и среднего количества просмотров за месяц для социальной сети ВКонтакте             #
#                                                                                                                   #
# MIT License                                                                                                       #
# Copyright (c) 2020 Michael Nikitenko                                                                              #
#                                                                                                                   #
#####################################################################################################################


def parse_vk():
    return [{'name': 'ololol', 'sn': 'ВКонтакте', 'link': 'https://vk.com', 'location': 'Салехард', 'subs': 1488, 'views': 420},]


if __name__ == '__main__':
    print('vk_parser')
